jayden-sudo/POKER-NOW/devices/zuowei-c3-lcd-pwr/sdkconfig.defaults
# --- 目標晶片:ESP32-C3(單核 RISC-V @160MHz)---
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# --- 控制台必須走 USB-Serial-JTAG:UART0 預設腳 GPIO20/21 已被 VB6824 與 USB 檢測佔用 ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- Flash 8MB **DIO** + 自訂分區(容 app + voice)---
# ★★ 嚴禁改 QIO(勿照抄 StickS3):本板 Zbit 25VQ64 跑 DIO,GPIO12/13 因 DIO 才空閒,
#    QIO 會把它們收回作 WP/HD → LCD 片選與電源自鎖雙雙失效(黑屏 + 開機即斷電)。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- 主棧 & FreeRTOS(§12:無 opus,8KB 足;FREERTOS_HZ=1000 供 10ms 去抖/20ms 音訊節拍)---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# --- VB6824:UART1,輸入 Opus16k(不用)+ 輸出 PCM16k,發送用任務(demo 驗證組合)---
CONFIG_VB6824_UART_PORT=1
CONFIG_VB6824_TYPE_OPUS_16K_20MS_PCM_16K=y
CONFIG_VB6824_SEND_USE_TASK=y
# CONFIG_VB6824_OTA_SUPPORT is not set

# --- LVGL 字體(與 StickS3 同三檔:14/20/28)---
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# --- Wi-Fi 僅用於 ESP-NOW:C3 無 PSRAM,收緊緩衝 + 關 AMPDU(demo 實機驗證值)---
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
